In [175]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt
%matplotlib inline

In [176]:
df=pd.read_csv("data/train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [177]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [178]:
df.dropna(subset=['Embarked'],inplace=True)
df.drop('PassengerId',axis=1,inplace=True)
df.drop('Name',axis=1,inplace=True)

In [179]:
df.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      0
dtype: int64

In [180]:
df.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')

In [181]:
df.to_csv('data/modified_train_data.csv',index=False)

In [182]:
df=pd.read_csv('data/modified_train_data.csv')

In [183]:
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [184]:
y=df['Survived']

In [185]:
x.head()

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,female,35.0,1,0,113803,53.1000,C123,S
4,3,male,35.0,0,0,373450,8.0500,NaN,S

In [186]:
x=df.drop('Survived',axis=1)

In [187]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [188]:
x.isna().sum(), y.isna().sum()

(Pclass        0
 Sex           0
 Age         177
 SibSp         0
 Parch         0
 Ticket        0
 Fare          0
 Cabin       687
 Embarked      0
 dtype: int64, 0)

In [189]:
x.dtypes

Pclass        int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [190]:
from sklearn.impute import SimpleImputer
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder

In [191]:
age_fet=['Age']
cabin_fet=['Cabin']

age_imputer=SimpleImputer(strategy='most_frequent')
cabin_imputer=SimpleImputer(strategy='constant',fill_value='missing')

transformer=ColumnTransformer([
    ('age_imputer',age_imputer,age_fet),
    ('cabin_imputer',cabin_imputer,cabin_fet)
],remainder='passthrough')

transformedX=transformer.fit_transform(x)

In [192]:
x.columns

Index(['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin',
       'Embarked'],
      dtype='object')

In [193]:
modifiedX=pd.DataFrame(transformedX,columns=['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin',
       'Embarked'])

In [194]:
modifiedX.head()

  Pclass      Sex Age   SibSp Parch Ticket              Fare    Cabin Embarked
0     22  missing   3    male     1      0         A/5 21171     7.25        S
1     38      C85   1  female     1      0          PC 17599  71.2833        C
2     26  missing   3  female     0      0  STON/O2. 3101282    7.925        S
3     35     C123   1  female     1      0            113803     53.1        S
4     35  missing   3    male     0      0            373450     8.05        S

In [195]:
modifiedX.isna().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Cabin       0
Embarked    0
dtype: int64

In [196]:
x.dtypes

Pclass        int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [197]:
#modifiedX['Pclass']=modifiedX['Pclass'].astype('int64')

In [198]:
#modifiedX['Age']=modifiedX['Age'].astype('float64')

In [199]:
modifiedX.dtypes

Pclass      object
Sex         object
Age         object
SibSp       object
Parch       object
Ticket      object
Fare        object
Cabin       object
Embarked    object
dtype: object

In [200]:
fet=['Sex','SibSp','Ticket','Fare','Cabin','Embarked']
onehot=OneHotEncoder()

tr=ColumnTransformer([
    ('onehot',onehot,fet)
],remainder='passthrough')

In [201]:
transformedData=tr.fit_transform(modifiedX)

In [202]:
transformedData.shape

(889, 1089)

In [203]:
from sklearn.ensemble import RandomForestClassifier

clf=RandomForestClassifier(n_estimators=100)

clf.fit(transformedData,y);

In [204]:
clf.score(transformedData,y)

0.9988751406074241

In [205]:
testing=pd.read_csv('data/test.csv')
testing.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [206]:
testing.drop('PassengerId',axis=1,inplace=True)

In [207]:
testing.drop('Name',axis=1,inplace=True)

In [208]:
testing.head()

   Pclass     Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0       3    male  34.5      0      0   330911   7.8292   NaN        Q
1       3  female  47.0      1      0   363272   7.0000   NaN        S
2       2    male  62.0      0      0   240276   9.6875   NaN        Q
3       3    male  27.0      0      0   315154   8.6625   NaN        S
4       3  female  22.0      1      1  3101298  12.2875   NaN        S

In [209]:
testing.isna().sum()

Pclass        0
Sex           0
Age          86
SibSp         0
Parch         0
Ticket        0
Fare          1
Cabin       327
Embarked      0
dtype: int64

In [210]:
testing.dropna(subset=['Fare'],inplace=True)

In [211]:
testing.isna().sum()

Pclass        0
Sex           0
Age          86
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       326
Embarked      0
dtype: int64

In [212]:
testing.dtypes

Pclass        int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [213]:
age_fet=['Age']
cabin_fet=['Cabin']

age_imputer=SimpleImputer(strategy='most_frequent')
cabin_imputer=SimpleImputer(strategy='constant',fill_value='missing')

transformer=ColumnTransformer([
    ('age_imputer',age_imputer,age_fet),
    ('cabin_imputer',cabin_imputer,cabin_fet)
],remainder='passthrough')

transformed_test=transformer.fit_transform(testing)

In [214]:
modifiedTest=pd.DataFrame(transformed_test,columns=['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin',
       'Embarked'])

In [215]:
modifiedTest.head()

  Pclass      Sex Age   SibSp Parch Ticket     Fare    Cabin Embarked
0   34.5  missing   3    male     0      0   330911   7.8292        Q
1     47  missing   3  female     1      0   363272        7        S
2     62  missing   2    male     0      0   240276   9.6875        Q
3     27  missing   3    male     0      0   315154   8.6625        S
4     22  missing   3  female     1      1  3101298  12.2875        S

In [216]:
modifiedTest.isna().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Cabin       0
Embarked    0
dtype: int64

In [217]:
modifiedTest.dtypes

Pclass      object
Sex         object
Age         object
SibSp       object
Parch       object
Ticket      object
Fare        object
Cabin       object
Embarked    object
dtype: object

In [218]:
fet=['Sex','SibSp','Ticket','Fare','Cabin','Embarked']
onehot=OneHotEncoder()

tr=ColumnTransformer([
    ('onehot',onehot,fet)
],remainder='passthrough')

In [219]:
transformedTest=tr.fit_transform(modifiedTest)

In [220]:
transformedTest.shape

(417, 624)